[UI_TREE]
Machine=ハードウェア設定
POWER=電源特性
TOUCH=足踏み設定
[IPG,CO2]
MPULSE_FREQ＝維持パルス周波数（khz）
MPULSE_RELS=維持解放時間（us）
[IPG]
MO_DELAY_STEPS=MO遅延（us）
MODECHG_DELAY=モード切替遅延（ms）
[YAG,DP,EP,LD]
WORK_CURRENT_TYPE=ダイアログボックスに入る電流値
WORK_CURRENT_TYPEOption=レイヤ0電流｜設定値
WORK_CURRENT＝設定動作電流（A）
[ALL]
SAFE_DOOR=セキュリティゲート保護
SAFE_DOOROption=無効｜一時停止｜中止
MARKEND_SCAN=打標終了振動子位置
MARKEND_SCANOption=原点｜左上隅｜上端中心位置｜右上隅｜右中心位置｜右下隅｜下端中心位置｜左下隅｜左側中心位置｜カスタム位置
MARKEND_X=カスタム時X座標（mm）
MARKEND_Y＝カスタム時Y座標（mm）
[SCAN]
PREHEAT_ENABLE=振動子の予熱が必要か
PREHEAT_ENABLEOption=No｜Yes
PREHEAT_TIME＝最小予熱時間（分）
USE_LIMIT_JUMPDELAY=ジャンプ遅延を有効にするかどうか
USE_LIMIT_JUMPDELAYOption=No｜Yes
LIMIT_JUMPLEN＝ジャンプ距離制限（mm）
LIMIT_JUMPDELAY_MM=mm当たりのジャンプ時間（us）
[BitmapPower]
BitmapPower=グレースケールビットマップマーキング
AUT_TIME=減衰時間（us）
AUT_COFF=ゲイン係数（0-1）
[Signal]
Signal=信号設定
Cycle=トリガ有効回数
MARK_CNT=1回のマーキングコマンドを何回マーキングするか
DELAY=トリガ遅延（ms）
DLY_BETWEEN_MARK=2回のビーコン間遅延（ms）
MARK_END_DELAY=マーキング完了後の遅延（ms）
MARK_END_PULSE_W＝マーキング終了信号長（ms）
B_MARK_ONCE=トリガモード
B_MARK_ONCEOption=レベルトリガ｜エッジトリガ
Enable_Loop_Mdt=オフライン後のサイクルマーキング
Enable_Loop_MdtOption=使用不可｜使用可能
IOSELCOUNT=I/O選択文書信号数
ENABLE_CARDTOUCH=下位機トリガ
ENABLE_CARDTOUCHOption=使用不可｜使用可能
[UI_FACE]
ExportSysパラ=エクスポートパラメータ...
ImportSysパラ=インポートパラメータ...
Ok=OK
Cancel=キャンセル
Apply=適用


;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION= HL補正ソフトウェア
ID1022 =ソリューションセット
ID1023 =選択してください：
ID1007 =別のasを保存します
ID1017 =削除
ID1084 =インポート
ID1085 =エクスポート

ID1075 =正しいヘッダー
ID1024 =基本パラメーター
ID1025 =レート範囲（mm）：
ID1026 =マーキング範囲（mm）：
ID1072 =座標系
ID1077 =回転角
ID1079 = Xオフセット（mm）
ID1080 = yオフセット（mm）
ID1119 =振動ミラー1 = x
ID1120 =振動ミラー2 = x
ID1116 =逆
ID1117 =逆

ID1030 =グリッドとレベル補正（ズーム比を選択した後、自動計算ウィンドウをダブルクリックしてポップアップします）
ID1009 =レベルを追加します
ID1010 =削除レベル
ID1012 =マルチレベルの全体的な効果
ID1031 =ワードレベルに戻る：
ID1018 =最大レベルマークテキストグラフ

ID1053 =赤ガン補正
ID1043 = イネーブルメント
ID1054 = Xアステルビリティ比：
ID1055 = yズーム比：
ID1056 = x変位（mm）：
ID1057 = y偏差（mm）：

ID1058 =フォーカス
ID1065 =フォーカスメソッド
ID1059 =ダイナミックフォーカスタイプ
ID1060 =制御モード
ID1061 =シャフトの間隔（mm）
ID1082 =作業面の高さ（mm）へのfangtou
ID1063 =微調整値（um）
ID1062 =動的焦点補正係数

ID1011 =テストF7
ID1037 =停止
ID1014 = パラメータ >>

ID1109 =正しいタイプ
ID1099 =通常の修正
ID1100 =高精度補正1 [スキャナー]
ID1101 =高精度補正[実際の座標データをインポート
ID1110 =高精度補正説明：1、まず通常補正を選択して通常の補正を行い、座標系、赤色光補正、BOXサイズ及び変形を初歩的に調整する。2、高精度補正を選択し、メッシュポイントを生成する。3、異なるツールでデータを取得して処理した後、データをインポートする。
ID1114 =高精度補正データを直接インポートする

ID1089 =高精度補正
ID1086 =グリッドポイントを生成します
ID1111 =最初のステップ：グリッドポイントを生成します。
ID1112 =ステップ2：スキャナーまたは2次元測定で測定された実際の座標データを導入します。
ID1113 =ステップ3：高精度補正テーブルを作成し、保存出口を確認します。

ID1096 =スケーリング
ID1027 =高精度マーキング範囲（mm）
ID1097 =バンプ
ID1028 =テストボックスサイズ（mm）：
ID1091 =スキャナー処理後のデータのインポート
ID1087 =データのインポート
ID1016 =高精度補正テーブルを作成します
ID1139=補正テーブルの生成

ID1 = わかった
ID2 =キャンセル
ID1142=マーキング制御

[CALISET_DLG_167]
CAPTION=高精度データのインポート
ID1114 = x 2番目の次元で取得された座標ファイル：
ID1115 = y 2番目の次元で取得されたy座標ファイル：
ID1 = わかった
ID2 = キャンセル

[CALISET_DLG_159]
CAPTION = ソリューションを保存します
ID1036 =修正スキームは別々に保存されます：
ID1 = わかった
ID2 =キャンセル

[CALISET_DLG_131]
CAPTION = マーキングパラメーター
ID1032 =マーキング時間の数：
ID1033 =マーキング速度（mm/s）
ID1035 = 権力（％）
ID1034 = q頻度（khz）
ID1036 = Qリリース時間（私たち）
ID1037 =レーザーターバイドレイテンシ（米国）
ID1 = ok
ID2 =キャンセル

[CALISET_DLG_160]
CAPTION = ラベルラベル情報の設定
ID1093 =行数
ID1094 =列番号
ID1116 =ランク数のみを設定し、マークされていない
ID1 =マーキング
ID2 =キャンセル
ID1099=点
ID1100=十字
ID1101=円

[CALISET_DLG_164]
CAPTION = コントロールカードを選択します
ID1098 =ワーキングカードを選択してください：
ID1 = ok
ID2 =キャンセル

[CALISET_STRINGTABLE]
ID0 =ボックスサイズ（mm）
ID1 = Xズーム比％％
ID2 = yズーム比％％
ID3 = xでこぼこ
ID4 = yバンプ
ID5 = X台形
ID6 = y台形
ID7 = x並列
ID8 = y並列
ID9 = x正の割合％％
ID10 = x負の比率％％
ID11 = y正の割合％％
ID12 = y負の割合％％
ID13 = パラメータレベル
ID14 = 電流（a）
ID15 = 権力（％）
ID16 = 電流（％）
ID17 =レーザーパルス幅（ns）
ID18 =レーザーモード
ID999 =すでにマーキングソフトウェアまたは修正ソフトウェアが実行されているか、最初に閉じてください！
ID1000 =ベンチマークファイルの紛失または損傷、ソフトウェアが正常かどうかを確認してください！
ID1001 =マーキングコントロールカードの初期化に失敗しました！
ID1002 =ラベルコントロールカードシステムの設定に失敗しました！
ID1003 =最初にテストする修正レベルを選択してください！
ID1004 =操作に失敗しました。後で試してみてください！
ID1005 =すでに存在しているスキーム名はありますか？
ID1006 =修正の範囲は0になりません！
ID1007 =マーキングの範囲は0になりません！
ID1008 =補正の範囲の比例係数とマーキングの範囲が正しくありません。
ID1011 =レベルを削除するレベルを選択してください
ID1012 =少なくとも最初のレベルの修正を保管してください！
ID1013 =ファイルエラー！
ID1014 =修正データをカードに失敗するには、後で試してみてください！
ID1015 =この修正構成スキームは、現在のソフトウェアバージョンと矛盾しています。
ID1016 =ボックスサイズはマーキング範囲を超えることはできません！
ID1017 =ボックスサイズは前のレベルのサイズを超えることはできません！
ID1018 =現在の修正設定が変更されていますが、保存されていますか？
ID1019 =ファイルの読み取り失敗！
ID1020 =現在のスキームの削除を確認しますか？
ID1021 =ソフトウェア犬は検出されません！
ID1022 =ソフトウェア犬は検出されますが、法的なソフトウェア犬は検出されません！
ID1023 = 1つ以上の法的ソフトウェアが挿入されています！
ID1024 =最初の犬を犬を走らせるために変換しました。失敗しました！
ID1025 = "現在のソフトウェア承認の有効期限が切れており、ライセンスパッチマッチング（DOG ID =％S、検証コード=％S）を再適用するためにカスタマーサービススタッフに連絡する必要があります。
ID1026 = "d160"
ID1027 = "d480"
ID1028 = "CO2エンハンスメント"
ID1029 =「CO2の伝統」
ID1030 = "起動に失敗しました"
ID1031 =ボックスサイズは次のレベルより小さくすることはできません！
ID1032 =効果的な修正領域を超えて
ID1033 = "テレフォーカス"
ID1034 = "3Dダイナミックコーキング"
ID1035 = "通常のバックフォーカス"
ID1036 = "単純なレーザー制御モードは、マーキング範囲％DMMよりも小さくなければなりません" "
ID1037 = "失敗したカードに保存されている犬IDを取得してください。カードが拘束されるかどうかを確認してください」
ID1038 =「インポートフェール」
ID1039 =「インポートの成功」
ID1040 =「エクスポートが失敗した」
ID1041 =「エクスポートの成功」
ID1042 =「操作失敗」
ID1043 =「ファイルデータが一致しない」
ID1044 = "フォーカス3d"後に "
ID1045 = "x座標ファイルパスは空です！"
ID1046 = "y座標ファイルパスは空です！"
ID1047 =「カードの犬は暗号化された犬番号と矛盾しています」
ID1048 = "カードのカード番号は空です、または長さが正しくない" "

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1 = カードが初期化されていないか、カードが見つかりません。
2 = リセットに失敗しました!
3 =カードのバージョンが正しくありません!
4 = アラーム!
6 = 実行に失敗しました!
7=ステータスが対応していません!
16=コマンドがタイムアウトしました!
17=コマンドが失われました!
18=インターフェイス呼び出し非同期!
19=別のプログラムによって占有されているインタフェース!
20 = Z軸のオーバーランまたはファイルの破損を修正してください!
21=パラメータが一致しません!
23=メモリの割り当てに失敗しました!
100 = オフラインで使用!
101=コマンドが中止されました!
1001=ポート 1
1002=ポート 2
1003=ポート 3
1004=ポート 4
1005=ポート 5
1006=ポート 6
1007=ポート 7
1008 = レーザー入力の準備ができていません
1009 = レーザー入力準備完了

[4]
1 =レーザーの過熱、電源をオフにしてください!
2 =レーザー高アンチアラーム、電源をオフにしてください!
3 =レーザーMO異常、電源をオフにしてください!
4 =レーザーカバーが開いているので、電源を切ってレーザーカバーを取り付けてください!
5 =安全ドアが開いているので、閉めてください!
6=シャッターが異常に閉じています、電源を切ってシャッターを確認してください!
7=シャッターが異常に開いていませんので、電源を切ってシャッターを確認してください!
8 =安全ドアが開いており、マーキングが一時停止されています。マーキングを続けるには安全ドアを閉じてください!
9 = 安全扉が開き、マーキングが中止されました。
10 =レーザーシステムアラーム、電源をオフにしてください!
11=レーザー供給電圧が範囲外です。電源を切ってください!
12 =レーザー電源過電圧アラーム、電源をオフにしてレーザー出力を確認してください!
13 =レーザー電源低電圧アラーム、電源をオフにしてレーザー出力を確認してください!
14 = SPIレーザー過熱アラーム、電源をオフにしてください!
15 = SPIレーザー対応アンプ過電流アラーム、電源をオフにしてください!
16 = SPIレーザーパワーアンプ過電流アラーム、電源をオフにしてください!
17 = SPIレーザーコリメーションレーザーアラーム、電源をオフにしてください!
18 = SPIレーザー保持アラーム、電源をオフにしてください!
19 = SPIレーザーパワーアラーム、電源をオフにしてください!
20 =レーザー不明なアラーム、電源をオフにしてください!
21=レーザー出力過電流アラーム、電源をオフにしてください!
22 =レーザー出力過電圧アラーム、電源をオフにしてください!
23 =レーザー出力過熱アラーム、電源をオフにして放熱条件を確認してください!
24=レーザー出力がオンになっていません。電源を確認してください。
30=移動中に負の制限が発生し、マーキングは中止されます!
31=移動中に正の限界に達すると、マーキングは中止されます!
32=モーターパルスが範囲外です
33=検流計DAが範囲外です!
34=プラットフォームのX軸スーパーポジティブリミット!
35=プラットフォームのX軸の負の制限を超えています!
36=プラットフォームY軸超正限界!
37=プラットフォームのY軸の負の制限を超えています!
38=ガルバノメータースクエアヘッドに異常電力が供給されていますので、電源を切って確認してください!
54=512補正表に切り替えてください!
55=128補正表に切り替えてください!
100 = 安全扉は有効で開いています。
110 = 負の制限に達する!
111 =正の限界に達する!
112 = 動きのある原点を打つ!
500=検流計のウォームアップ、後でもう一度やり直してください!

[door]
1=安全ドアが開いているので、セキュリティドアを閉めてください!
2=安全ドアが開いており、マーキングが一時停止されています。マーキングを続行するには、安全ドアを閉じてください。
3 =セキュリティドアが開き、マーキングが中止されます!
4 =安全ドアが閉まっているので、マークを続けることができます!
5=安全ドアが閉まっていて、ステータスは正常です!
6=運動中に負の限界に達し、マーキングは中止されました!
7 = 移動中に正の限界に達し、マーキングが中止されます。 
[usb]
1 = EMCC カードは既に接続されています
2 = EMCC カードが取り外されました

[4101]
3 = DA カード 1 の機能とバージョン情報
4 = DA カード 1 バージョンの日付情報
5 = DA カード 1 の経過時間
7 = DA カード 1 のエラー フレーム数
9 = DA カード 1 から 4 番目のビット エラー時間までのカウントダウン
11 = DA カード 1 の 3 番目のビット エラーのカウントダウン時間
13 = DA カード 1 が 2 番目のビット エラーの時刻をカウントダウン
15 = DA カード 1 の最後のビット エラーが発生した時刻

[4102]
4 = DA カード 1 のアウトオブコード フレームの数
6 = DAカード1カウントダウン4回目のミスの時間
8 = DAカード1カウントダウン3番目のミスコードの時間
10 = DAカード1は、2番目の欠落したコードの時間をカウントダウンします
12 = DA カード 1 が最後に時間を逃した
14 = DAカード1検流計アラーム情報
15 = DAカード1ガルバノアラームオフレーザー有効

[4103]
3 = DA カード 2 の機能とバージョン情報
4 = DA カード 2 のバージョンの日付情報
5 = DA カード 2 の経過時間
7 = DAカード2のエラー・フレーム数
9 = DA カード 2 の 4 番目のビット エラーのカウントダウン時間
11 = DA カード 2 の 3 番目のビット エラーのカウントダウン時間
13 = DA カード 2 のカウントダウン、2 番目のビット エラーの時間
15 = DA カード 2 の最後のビット エラーが発生した時刻

[4104]
4 = DA カード 2 のアウトオブコード フレームの数
6 = DAカード2カウントダウン4回目のミスの時間
8 = DAカード2カウントダウン3回目のミスの時間
10 = DA カード 2 の最後から 2 番目の損失時間
12 = DA カード 2 が最後に見落とされた時刻
14 = DAカード2検流計アラーム情報
15 = DAカード2ガルバノアラームオフレーザー有効

[4105]
3 = レーザーカードの機能とバージョン情報
4 = レーザーカードのバージョン日付情報
5 = レーザーカードの経過時間
7 = レーザーカードのエラーフレーム数
9 = LASERカードの最後から2番目のビットエラーの時間
11 = LASERカードの最後から2番目のビット誤差の時間
13 = LASERカードの2番目のビットエラーまでカウントダウンする時間
15 = LASER カードの最後のビット エラーが発生した時刻

[4106]
4 =レーザーカードの欠落フレームの数
6 = LASERカードが4回目のカウントダウンのコードを失う時刻
8 = LASERカードが3回目のカウントダウンのコードを失った時間
10 = レーザーカードが最後から2番目の時間のコードを失った時間
12 = レーザーカードが最後に見逃したコード
14 =レーザー検流計アラームメッセージ
15 =レーザーカードレーザーアラームオフレーザー有効

[4107]
3 =レーザーカードレーザー電流ns波形
4 =レーザーカードレーザー電流ps波形
5 =レーザーカードレーザー電流fs波形
6 =レーザーカードレーザーは現在パワーを維持しています

[4102Warning]
0 = D0:DAカード1のデータ通信が異常です
1 = D1:DAカード1スキャナーシステムアラーム
2 = D2:DAカード1スキャナー温度アラーム
3 = D3:DAカード1スキャナー低速アラーム
4=D4: 未使用
5=D5: 未使用
6=D6: 未使用
7=D7: 未使用
8=D8: 未使用
9=D9: 未使用
10=D10: 未使用
11=D11: 未使用
12=D12: 未使用
13=D13: 未使用
14=D14: 未使用
15 = D15: EMCC カード データ通信異常

[4104Warning]
0 = D0:DAカード2のデータ通信が異常です
1 = D1:DAカード2スキャナーシステムアラーム
2 = D2:DAカード2スキャナー温度アラーム
3 = D3:DAカード2スキャナー低速アラーム
4=D4: 未使用
5=D5: 未使用
6=D6: 未使用
7=D7: 未使用
8=D8: 未使用
9=D9: 未使用
10=D10: 未使用
11=D11: 未使用
12=D12: 未使用
13=D13: 未使用
14=D14: 未使用
15=D15: 未使用

[4106Warning]
0 = D0:レーザーカードデータ通信が異常です
1 = D1:レーザー温度アラーム
2 = D2:電源アラーム
3 = D3:システムアラーム
4 = D4:高アンチアラーム
5 = D5:レーザーの準備ができていません
6 = D6:シードレーザー点火に失敗しました
7 = D7:シードレーザー温度アラーム
8 = D8: MO 過電流アラーム
9 = D9: PA 過電流アラーム
10 = D10:コリメータアラーム
11 = D11: アラーム 5 の保留
12 = D12: アラーム 4 を保持します
13 = D13: アラーム 3 を保持します
14 = D14: アラーム 2 の保留
15 = D15: アラーム 1 を保持します

[Refresh]
Interval= 500


